MikroElektronika/core_packages/dsPIC/XC16/def/PIC24F08KA102/mcu.h
/*
** Only one invocation of FPOR should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FPOR.
** Multiple options may be combined, as shown:
**
** _FPOR( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Brown-out Reset Enable bits:
**     BOREN_BOR0           Brown-out Reset disabled in hardware; SBOREN bit disabled
**     BOREN_BOR1           Brown-out Reset controlled with the SBOREN bit setting
**     BOREN_BOR2           Brown-out Reset enabled only while device is active and disabled in Sleep; SBOREN bit disabled
**     BOREN_BOR3           Brown-out Reset enabled in hardware; SBOREN bit disabled
**
**   Power-up Timer Enable bit:
**     PWRTEN_OFF           PWRT disabled
**     PWRTEN_ON            PWRT enabled
**
**   Alternate I2C1 Pin Mapping bit:
**     I2C1SEL_SEC          Alternate location for SCL1/SDA1 pins
**     I2C1SEL_PRI          Default location for SCL1/SDA1 pins
**
**   Brown-out Reset Voltage bits:
**     BORV_LPBOR           Low-power Brown-Out Reset occurs around 2.0V
**     BORV_V27             Brown-out Reset set to Highest Voltage (2.7V)
**     BORV_V20             Brown-out Reset set at 2.0V
**     BORV_V18             Brown-out Reset set to lowest voltage (1.8V)
**
**   MCLR Pin Enable bit:
**     MCLRE_OFF            RA5 input pin enabled; MCLR disabled
**     MCLRE_ON             MCLR pin enabled; RA5 input pin disabled
**
*/

#define BOREN_BOR0           0x00F8
#define BOREN_BOR1           0x00F9
#define BOREN_BOR2           0x00FA
#define BOREN_BOR3           0x00FB

#define PWRTEN_OFF           0x00F3
#define PWRTEN_ON            0x00FB

#define I2C1SEL_SEC          0x00EB
#define I2C1SEL_PRI          0x00FB

#define BORV_LPBOR           0x009B
#define BORV_V27             0x00BB
#define BORV_V20             0x00DB
#define BORV_V18             0x00FB

#define MCLRE_OFF            0x007B
#define MCLRE_ON             0x00FB

/* Register FICD (0xf8000e)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FICD;
#define _FICD(x) __attribute__((address(0xf8000e),deprecated_definition("consider migrating to #pragma config"),section("__FICD.sec"),space(prog))) __prog__ uint16_t _FICD = (x);

/*
** Only one invocation of FICD should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FICD.
** Multiple options may be combined, as shown:
**
** _FICD( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   ICD Pin Placement Select bits:
**     ICS_PGx3             PGC3/PGD3 are used for programming and debugging the device
**     ICS_PGx2             PGC2/PGD2 are used for programming and debugging the device
**     ICS_PGx1             PGC1/PGD1 are used for programming and debugging the device
**
**   Background Debugger Enable bit:
**     BKBUG_ON             Background debugger functions enabled
**     BKBUG_OFF            Background debugger disabled
**
*/

#define ICS_PGx3             0x00C1
#define ICS_PGx2             0x00C2
#define ICS_PGx1             0x00C3

#define BKBUG_ON             0x00C3
#define BKBUG_OFF            0x00C3

/* Register FDS (0xf80010)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDS;
#define _FDS(x) __attribute__((address(0xf80010),deprecated_definition("consider migrating to #pragma config"),section("__FDS.sec"),space(prog))) __prog__ uint16_t _FDS = (x);

/*
** Only one invocation of FDS should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDS.
** Multiple options may be combined, as shown:
**
** _FDS( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Deep Sleep Watchdog Timer Postscale Select bits:
**     DSWDTPS_DSWDTPS0     1:2 (2.1 ms)
**     DSWDTPS_DSWDTPS1     1:8 (8.3 ms)
**     DSWDTPS_DSWDTPS2     1:32 (33 ms)
**     DSWDTPS_DSWDTPS3     1:128 (132 ms)
**     DSWDTPS_DSWDTPS4     1:512 (528 ms)
**     DSWDTPS_DSWDTPS5     1:2048 (2.1 Seconds)
**     DSWDTPS_DSWDTPS6     1:8192 (8.5 Seconds)
**     DSWDTPS_DSWDTPS7     1:32,768 (34 Seconds)
**     DSWDTPS_DSWDTPS8     1:131,072 (135 Seconds)
**     DSWDTPS_DSWDTPS9     1:524,288 (9 Minutes)
**     DSWDTPS_DSWDTPSA     1:2,097,152 (36 Minutes)
**     DSWDTPS_DSWDTPSB     1:8,388,608 (2.4 Hours)
**     DSWDTPS_DSWDTPSC     1:33,554,432 (9.6 Hours)
**     DSWDTPS_DSWDTPSD     1:134,217,728 (38.5 Hours)
**     DSWDTPS_DSWDTPSE     1:536,870,912 (6.4 Days)
**     DSWDTPS_DSWDTPSF     1:2,147,483,648 (25.7 Days)
**
**   DSWDT Reference Clock Select bit:
**     DSWDTOSC_SOSC        DSWDT uses SOSC as reference clock
**     DSWDTOSC_LPRC        DSWDT uses LPRC as reference clock
**
**   RTCC Reference Clock Select bit:
**     RTCOSC_LPRC          RTCC uses LPRC as reference clock
**     RTCOSC_SOSC          RTCC uses SOSC as reference clock
**
**   Deep Sleep Zero-Power BOR Enable bit:
**     DSBOREN_OFF          Deep Sleep BOR disabled in Deep Sleep
**     DSBOREN_ON           Deep Sleep BOR enabled in Deep Sleep
**
**   Deep Sleep Watchdog Timer Enable bit:
**     DSWDTEN_OFF          DSWDT disabled
**     DSWDTEN_ON           DSWDT enabled
**
*/

#define DSWDTPS_DSWDTPS0     0x00F0
#define DSWDTPS_DSWDTPS1     0x00F1
#define DSWDTPS_DSWDTPS2     0x00F2
#define DSWDTPS_DSWDTPS3     0x00F3
#define DSWDTPS_DSWDTPS4     0x00F4
#define DSWDTPS_DSWDTPS5     0x00F5
#define DSWDTPS_DSWDTPS6     0x00F6
#define DSWDTPS_DSWDTPS7     0x00F7
#define DSWDTPS_DSWDTPS8     0x00F8
#define DSWDTPS_DSWDTPS9     0x00F9
#define DSWDTPS_DSWDTPSA     0x00FA
#define DSWDTPS_DSWDTPSB     0x00FB
#define DSWDTPS_DSWDTPSC     0x00FC
#define DSWDTPS_DSWDTPSD     0x00FD
#define DSWDTPS_DSWDTPSE     0x00FE
#define DSWDTPS_DSWDTPSF     0x00FF

#define DSWDTOSC_SOSC        0x00EF
#define DSWDTOSC_LPRC        0x00FF

#define RTCOSC_LPRC          0x00DF
#define RTCOSC_SOSC          0x00FF

#define DSBOREN_OFF          0x00BF
#define DSBOREN_ON           0x00FF

#define DSWDTEN_OFF          0x007F
#define DSWDTEN_ON           0x00FF



/*
 * Memory Segments Sizes
 */

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0xfc

#define ___RESERVED_BASE 0x100
#define ___RESERVED_LENGTH 0x4

#define __AIVT_BASE 0x104
#define __AIVT_LENGTH 0xfc

#define __PROGRAM_BASE 0x200
#define __PROGRAM_LENGTH 0x1400

#define __EEDATA_BASE 0x7ffe00
#define __EEDATA_LENGTH 0x200

#define __FBS_BASE 0xf80000
#define __FBS_LENGTH 0x2

#define __FGS_BASE 0xf80004
#define __FGS_LENGTH 0x2

#define __FOSCSEL_BASE 0xf80006
#define __FOSCSEL_LENGTH 0x2

#define __FOSC_BASE 0xf80008
#define __FOSC_LENGTH 0x2

#define __FWDT_BASE 0xf8000a
#define __FWDT_LENGTH 0x2

#define __FPOR_BASE 0xf8000c
#define __FPOR_LENGTH 0x2

#define __FICD_BASE 0xf8000e
#define __FICD_LENGTH 0x2

#define __FDS_BASE 0xf80010
#define __FDS_LENGTH 0x2

#define __DEVID_BASE 0xff0000
#define __DEVID_LENGTH 0x4

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x600

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x600

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x600



#endif
